document.addEventListener("DOMContentLoaded", function () {
    const navbar = document.getElementById("naveBar");

    window.addEventListener("scroll", function () {
        if (window.scrollY > 50) {
            navbar.classList.add("sticky");
        } else {
            navbar.classList.remove("sticky");
        }
    });
});
const navToggle = document.querySelector('.nav-toggle');
const navLinks = document.querySelector('.nav-links');

navToggle.addEventListener('click', () => {
    navLinks.classList.toggle('show');
});

const books = document.querySelectorAll(".book");
const labels = [
    "هل جربت أن تتعامل بعملة مختلفة عن العملات الورقية...ليست معدنية وليست ذهبية...الثروة هنا من نوع اخر...لن تدفع مالا لتأخذ بل ستدفع من ذكائك",
    "لم أرى من قبل خوف وجوه أهل زيكولا مثلما كنت أراه تلك اللحظات أسفل أنوار المشاعل. أعلم أنهم يلعنون أسيل في داخلهم . لكنهم قد تجاهلو عمدا أنهم من اقتنصوا ذكاءها كاملا دون أن تضر واحدا منهم يوما",
    "في أرض يحكمها شاهد السماء عاش البشر والذئاب والملديون في سلم امتد الاف السنين قبل أن يجتاز ذئب رهيب احدى العابرات الست، ويلتقي موسى الباحث عن أقرب فرصة للخروج من بلدته، ليتبدل كل شيء",
    "ماذا لو وجدت نفسك بأرض أقصى مايمكنك بلوغه بها هو خمسون عاما..ليست هذه القاعدة الوحيدة فحسب،بل هناك ماهو أكثر من ذلك",
    "انهار كل شيء فجأة، وعاد الوادي الى ماكان عليه قبل سنوات، بل صار اسوأ من ذلك، وبدلا من انتصار ثالث طمعنا في تحقيقه على أشراف جارتين يوم الغفران الأخير..أصبنا نحن بالضربة القاضية",
    "كنت أظن أن تغيير القواعد يحتاج الى القوة فحسب، لكنه لم يكن بهذه السهولة قط، لقد آثر أشراف جارتين أن يموتوا غرقى أسفل أمواج أكما على أن يتساووا معنا في حق اكتساب الروح",
    "لاحت من بعيد أكواخ صغيرة لكنها متقاربة مصفوفة بانتظام في مجاميع يفصل بينها ممرات أرضها مغطاة بزهور صغيرة صفراء. تناهى إلى سمعه صوت أنتوي ناعم. كان ينتديه ويكرر كلمة غريبة لم يدرك كنهها؟ (إيكادولي...إيكادولي)",
    "صهل فرس منهم فعلت جلجلة رفاقه بأصوات صافية مستدقة، ثم تقدمهم فلاحقوه ضبحا حتى وصلوا أخيرا لبستان واسع أخضر مدهام، لو كنت خيلا لأجفلت منهم، ولو كنت من البشر لأجفلت منهم أيضا، فتلك الأصوات التي تعالت عندما هدأ كرير صدورهم لم تكن أصوات خيول أبدا بل كانت اصوات البشر",
    "تحت سطح الماء كان غناء حيتان أوركا ينساب شجيا مهدهدا لسطح الماء، بجمالهم الأخاذ وقوتهم الظاهرة وألوانهم البديعة كانوا يعيشون في جماعات، لو أنصت اليهم وكنت تفهم لغة الأوركا لأحببتهم ولكن لو راقبتهم خلال الليالي في نهاية كل شهر قمري سيقشعر بدنك",
    "مرحبا أيها المحارب، هل سافرت معنا لثلاث رحلات محلقا على جناح صقر الى مملكة البلاغة؟ ان كنت قد فعلتها حقا فهلم لرحلة رابعة",
    "لماذا تشعر الآن وكأنها عجوز على الرغم من كونها في الواحد والعشرين من عمرها تناهى الى مسامعها صوت خطوات تقترب، طرق أحدهم على الباب ثلاث طرقات بقوة، فتح الباب ببطء وكان له أزير مخيف. ودلف ضيفها، وجلس في سكون ينتظر منها أن تبوح بكل الاسرار، واخيرا اذدردت ريقها وعادت بذاكرتها لعشر سنوات مضت وبدأت تخرج مابجعبتها من اسرار. ثمة حكايا غريبة ستروى هنا",
    "كان يشعر بألم شديد ينخر عظامه ورأسه، دارت عيناه في المكان كما لو أنهما تحررتا من عقال.انتفضت ذراعاه فجأة فدفع أبويه وسقطا على الارض، ثم وقف وسط غرفته لينبثق ضوء متموج خلاب مختلط الالوان ليحيط بجسده، ظل على حاله منيرا ومتوهجا دون ان يعرف السبب، ثم ادرك بعد ذلك حقيقة انه مختلف",
    "وهناك من يرى أن في أفكاري خطرا كبيرا على الجيل الصاعد وكأن هذا الجيل خلق ليصعد على سلم مبادئه فقط. حرية التفكير جزء لايتجزأ من حرية التعبير لذلك كانت هذه الرواية ضمن مجموعة الخيال العلمي فهي بذلك ستكسب قبول اكثر كونها مصنفة كمجرد أضغاث أفكار",
    "نعيش اليوم في عالم مشبع بالماديات، التي تغشي ابصارنا عن عالم اخر...عالم مواز واكثر ظلمة..عالم يختفي خلف العمى..عمى اصاب معظمنا",
    "مشكلتنا لم تكن يوما الالتزام او التفريط..مشكلتنا كانت ومازالت التطرف في احد الاتجاهين..البقاء في الوسط مفهوم لم نتقن التعامل معه حتى الان..تطرفنا في الكرم وحولناه لتبذير واسراف..تطرفنا في النصح وجعلناه ترهيبا..وتطرفنا في الخوف..وسلمناه زمام حياتنا..فأصبحنا عبيدا له",
    "في هذه الغرفة تحتشد اشنع مخاوفك التي داريتها حتى عن نفسك منذ كنت طفلا..في هذه الغرفة يتلاشى الحاجز بين الحقيقة والوهم بين الماضي والمستقبل وبين ذاتك والاخرين..لاتتلصص ولاتختلس النظرات عبر ثقب المفتاح..فقط فلتدر مقبض الباب في هدوء وحذر..ولتدخل الغرفة رقم207",
    "دعني اتنح بك جانبا لأخبرك بسر لايعرفه سوانا.احترس! لاترفع صوتك..عندما نحلم، فان وعينا يسافر لبعد آخر ليمارس حياة أخرى ويلقى أناسا آخرين،ويعرف وجوها أخرى",
    "لقد عزل الاغنياء انفسهم في يوتوبيا الساحل الشمالي تحت حراسة المارينز الامريكيين بينما ينسحق الفقراء خارجها ينهش بعضهم لحم بعض من اجل العيش ولكن حين يتسلل الراوي وصديقته خارج يوتوبيا بدافع الملل وبحثا عن صيد بشري يحدث مايهدد الوضع المستقر بالانفجار",
    "هناك طريق نختاره بارادتنا..وعندما نسير فيه نفقد تلك الارادة",
    "أهدي تلك الرواية الى الموكل بقبض روحي..الى ملك الموت",
    "لايمكنك ان تجبر احد على الابتسام..الا وهو ميت"
];

books.forEach((book, index) => {
    const label = document.createElement("span");
    label.className = "label";
    label.textContent = labels[index] || `Download Book ${index + 1}`;
    book.appendChild(label);
});
